In [1]:
# Dependencies
import numpy as np
import datetime as dt
import pandas as pd

# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func

In [2]:
engine = create_engine("sqlite:///hawaii.sqlite")

# reflect an existing database into a new model
Base = automap_base()
# reflect the tables
Base.prepare(engine, reflect=True)

# Save references to each table
Measurement = Base.classes.measurement
Station = Base.classes.station

In [3]:
# Create our session (link) from Python to the DB
session = Session(engine)

## D1: Determine the Summary Statistics for June

In [4]:
# 1. Import the sqlalchemy extract function.
from sqlalchemy import extract

# 2. Write a query that filters the Measurement table to retrieve the temperatures for the month of June. 
# create empty list and write query to access data
results = []
results = session.query(Measurement.date, Measurement.tobs).all()

In [5]:
#  3. Convert the June temperatures to a list.

In [6]:
# 4. Create a DataFrame from the list of temperatures for the month of June. 
# not just june
df = pd.DataFrame(results)
df.columns= ["date", "tobs"]
df.sample(5)

             date  tobs
11294  2015-01-04  72.0
7226   2016-04-21  74.0
16744  2014-12-28  76.0
4002   2013-07-26  75.0
14822  2017-03-26  77.0

In [7]:
# convert date column to datetime
df['date'] = pd.to_datetime(df['date'])
# filter df by month == june
df = df[df['date'].dt.month == 6]
df.sample(5)

            date  tobs
13803 2014-06-10  69.0
14534 2016-06-11  72.0
14525 2016-06-02  67.0
11106 2014-06-09  78.0
1931  2015-06-18  78.0

In [8]:
# 5. Calculate and print out the summary statistics for the June temperature DataFrame.
df.describe()

              tobs
count  1700.000000
mean     74.944118
std       3.257417
min      64.000000
25%      73.000000
50%      75.000000
75%      77.000000
max      85.000000

## D2: Determine the Summary Statistics for December

In [9]:
# 6. Write a query that filters the Measurement table to retrieve the temperatures for the month of December.
results = []
results = session.query(Measurement.date, Measurement.tobs).all()

In [10]:
# 7. Convert the December temperatures to a list.
df = pd.DataFrame(results)
df.columns= ["date", "tobs"]
df.sample(5)

             date  tobs
12496  2010-11-07  76.0
15739  2012-03-10  72.0
6667   2014-06-14  78.0
1187   2013-06-01  79.0
9756   2010-08-30  76.0

In [11]:
# 8. Create a DataFrame from the list of temperatures for the month of December. 
# convert date column to datetime
df['date'] = pd.to_datetime(df['date'])
# filter df by month == june
df = df[df['date'].dt.month == 12]
df.sample(5)

            date  tobs
18628 2014-12-11  71.0
17949 2012-12-05  71.0
4512  2014-12-25  77.0
4130  2013-12-02  70.0
10219 2011-12-09  74.0

In [12]:
# 9. Calculate and print out the summary statistics for the Decemeber temperature DataFrame.
df.describe()

              tobs
count  1517.000000
mean     71.041529
std       3.745920
min      56.000000
25%      69.000000
50%      71.000000
75%      74.000000
max      83.000000